modules/controllers/ManageController.php

    public function actionManagers()
    {
        $this->layout = "layout1";
        $model = Admin::find();
        $count = $model->count();
        $pageSize = Yii::$app->params['pageSize']['manage'];
        $pager = new Pagination(['totalCount' => $count, 'pageSize' => $pageSize]);
        $managers = $model->offset($pager->offset)->limit($pager->limit)->all();
---
SELECT COUNT(*) FROM `shop_admin`
SELECT * FROM `shop_admin` LIMIT 10

    public function actionChangeemail()
    {
        $this->layout = 'layout1';
        $model = Admin::find()->where('adminuser = :user', [':user' => Yii::$app->session['admin']['adminuser']])->one();
---
SELECT * FROM `shop_admin` WHERE adminuser = 'admin'