models/Category.php

    public function getData()
    {
        $cates = self::find()->all();
---
SELECT * FROM `shop_category`

    public static function getMenu()
    {
        $top = self::find()->where('parentid = :pid', [":pid" => 0])->limit(11)->orderby('createtime asc')->asArray()->all();
---
SELECT * FROM `shop_category` WHERE parentid = 0 ORDER BY `createtime` LIMIT 11