models/User.php

SELECT EXISTS(SELECT * FROM `shop_user` WHERE `username`='imooc_57bd3c67afb3f')
---
    public function getUser()
    {
        return self::find()->where('username = :loginname or useremail = :loginname', [':loginname' => $this->loginname])->one();